jimmywong2003/nrf5281x_s113_uart_example/ble_app_uart_c_libuarte/main.c
void libuart_event_handler(void * context, nrf_libuarte_async_evt_t * p_evt)
{
        nrf_libuarte_async_t * p_libuarte = (nrf_libuarte_async_t *)context;
        ret_code_t ret, err_code;
        uint16_t length;

        switch (p_evt->type)
        {
        case NRF_LIBUARTE_ASYNC_EVT_ERROR:
                break;
//        case NRF_LIBUARTE_ASYNC_EVT_RX_DATA_DMA_FULL:
//                NRF_LOG_INFO("NRF_LIBUARTE_ASYNC_EVT_RX_DATA_DMA_FULL");

        case NRF_LIBUARTE_ASYNC_EVT_RX_DATA:
                length = p_evt->data.rxtx.length;
                NRF_LOG_INFO("UART Rx 1st bye: 0x%x total len: %d", p_evt->data.rxtx.p_data[0], length);
                // process RX buffer
                // here we send it out directly by BLE
                if (m_conn_handle != BLE_CONN_HANDLE_INVALID)
                {
                        do
                        {
                                // err_code = ble_nus_data_send(&m_nus, p_evt->data.rxtx.p_data, &length, m_conn_handle);
                                // if ((err_code != NRF_ERROR_INVALID_STATE) && (err_code != NRF_ERROR_RESOURCES) &&
                                //     (err_code != NRF_ERROR_NOT_FOUND))
                                // {
                                //         APP_ERROR_CHECK(err_code);
                                // }
                                err_code = ble_nus_c_string_send(&m_ble_nus_c, p_evt->data.rxtx.p_data, length);
                                // err_code = ble_nus_data_send(&m_nus, p_evt->data.rxtx.p_data, &length, m_conn_handle);
                                if ((err_code != NRF_ERROR_INVALID_STATE) && (err_code != NRF_ERROR_RESOURCES) &&
                                    (err_code != NRF_ERROR_NOT_FOUND))
                                {
                                        APP_ERROR_CHECK(err_code);
                                }
                        } while (err_code == NRF_ERROR_RESOURCES);
                }

                // required. release rx buffer to get prepared for the next rx. Release the buffer after the buffer is
                // processed
                nrf_libuarte_async_rx_free(p_libuarte, p_evt->data.rxtx.p_data, p_evt->data.rxtx.length);

                break;


        case NRF_LIBUARTE_ASYNC_EVT_TX_DONE:
                // add tx_done app logic
                if (!nrf_queue_is_empty(&m_buf_queue))
                {
                        buffer_t buf;
                        err_code = nrf_queue_pop(&m_buf_queue, &buf);
                        APP_ERROR_CHECK(err_code);
                        UNUSED_RETURN_VALUE(nrf_libuarte_async_tx(p_libuarte, buf.data_array, buf.len));
                }
                break;

        case NRF_LIBUARTE_ASYNC_EVT_OVERRUN_ERROR:
                NRF_LOG_INFO("NRF_LIBUARTE_ASYNC_EVT_OVERRUN_ERROR");
                break;


        default:
                break;
        }
}
/**
 * @brief Function for main application entry.
 */
void libuart_init(void)
{
        ret_code_t err_code;
        nrf_libuarte_async_config_t nrf_libuarte_async_config = {
                .tx_pin     = TX_PIN_NUMBER,
                .rx_pin     = RX_PIN_NUMBER,
                .baudrate   = NRF_UARTE_BAUDRATE_115200,
                .parity     = NRF_UARTE_PARITY_EXCLUDED,
                .hwfc       = NRF_UARTE_HWFC_DISABLED,
                .timeout_us = 100,
                .int_prio   = APP_IRQ_PRIORITY_LOW_MID
        };

        err_code = nrf_libuarte_async_init(&libuarte, &nrf_libuarte_async_config, libuart_event_handler, (void *)&libuarte);

        APP_ERROR_CHECK(err_code);

        nrf_libuarte_async_enable(&libuarte);

}



/**@brief Function for handling asserts in the SoftDevice.
 *
 * @details This function is called in case of an assert in the SoftDevice.
 *
 * @warning This handler is only an example and is not meant for the final product. You need to analyze
 *          how your product is supposed to react in case of assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num     Line number of the failing assert call.
 * @param[in] p_file_name  File name of the failing assert call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
        app_error_handler(0xDEADBEEF, line_num, p_file_name);
}


/**@brief Function for handling the Nordic UART Service Client errors.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void nus_error_handler(uint32_t nrf_error)
{
        APP_ERROR_HANDLER(nrf_error);
}


/**@brief Function to start scanning. */
static void scan_start(void)
{
        ret_code_t ret;

        ret = nrf_ble_scan_start(&m_scan);
        APP_ERROR_CHECK(ret);

        ret = bsp_indication_set(BSP_INDICATE_SCANNING);
        APP_ERROR_CHECK(ret);
}


/**@brief Function for handling Scanning Module events.
 */
static void scan_evt_handler(scan_evt_t const * p_scan_evt)
{
        ret_code_t err_code;

        switch(p_scan_evt->scan_evt_id)
        {
        case NRF_BLE_SCAN_EVT_CONNECTING_ERROR:
        {
                err_code = p_scan_evt->params.connecting_err.err_code;
                APP_ERROR_CHECK(err_code);
        } break;

        case NRF_BLE_SCAN_EVT_CONNECTED:
        {
                ble_gap_evt_connected_t const * p_connected =
                        p_scan_evt->params.connected.p_connected;
                // Scan is automatically stopped by the connection.
                NRF_LOG_INFO("Connecting to target %02x%02x%02x%02x%02x%02x",
                             p_connected->peer_addr.addr[0],
                             p_connected->peer_addr.addr[1],
                             p_connected->peer_addr.addr[2],
                             p_connected->peer_addr.addr[3],
                             p_connected->peer_addr.addr[4],
                             p_connected->peer_addr.addr[5]
                             );
        } break;

        case NRF_BLE_SCAN_EVT_SCAN_TIMEOUT:
        {
                NRF_LOG_INFO("Scan timed out.");
                scan_start();
        } break;

        default:
                break;
        }
}


/**@brief Function for initializing the scanning and setting the filters.
 */
static void scan_init(void)
{
        ret_code_t err_code;
        nrf_ble_scan_init_t init_scan;

