jimmywong2003/nrf5281x_s113_uart_example/ble_app_uart_c_libuarte/main.c
        memset(&init_scan, 0, sizeof(init_scan));

        init_scan.p_scan_param     = &m_scan_param;
        init_scan.connect_if_match = true;
        init_scan.conn_cfg_tag     = APP_BLE_CONN_CFG_TAG;

        err_code = nrf_ble_scan_init(&m_scan, &init_scan, scan_evt_handler);
        APP_ERROR_CHECK(err_code);

        if (strlen(m_target_periph_name) != 0)
        {
                err_code = nrf_ble_scan_filter_set(&m_scan,
                                                   SCAN_NAME_FILTER,
                                                   m_target_periph_name);
                APP_ERROR_CHECK(err_code);

                err_code = nrf_ble_scan_filters_enable(&m_scan, NRF_BLE_SCAN_NAME_FILTER, false);
                APP_ERROR_CHECK(err_code);
        }

        err_code = nrf_ble_scan_filter_set(&m_scan, SCAN_UUID_FILTER, &m_nus_uuid);
        APP_ERROR_CHECK(err_code);

        err_code = nrf_ble_scan_filters_enable(&m_scan, NRF_BLE_SCAN_UUID_FILTER, false);
        APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling database discovery events.
 *
 * @details This function is a callback function to handle events from the database discovery module.
 *          Depending on the UUIDs that are discovered, this function forwards the events
 *          to their respective services.
 *
 * @param[in] p_event  Pointer to the database discovery event.
 */
static void db_disc_handler(ble_db_discovery_evt_t * p_evt)
{
        ble_nus_c_on_db_disc_evt(&m_ble_nus_c, p_evt);
}


/**@brief Function for handling characters received by the Nordic UART Service (NUS).
 *
 * @details This function takes a list of characters of length data_len and prints the characters out on UART.
 *          If @ref ECHOBACK_BLE_UART_DATA is set, the data is sent back to sender.
 */
static void ble_nus_chars_received_uart_print(uint8_t * p_data, uint16_t data_len)
{
        ret_code_t ret_val;
        uint32_t err_code;
        static uint8_t ble_data[LIBUARTE_DATA_LENGTH];
        NRF_LOG_DEBUG("Receiving data.");
        NRF_LOG_HEXDUMP_DEBUG(p_data, data_len);


        // 250 is only used for demo. you can use other proper value instead
        memcpy(ble_data, p_data, data_len);

        err_code = nrf_libuarte_async_tx(&libuarte, ble_data, data_len);

        if (err_code == NRF_ERROR_BUSY)
        {
                buffer_t buf;
                buf.len = data_len;
                memcpy(buf.data_array, p_data, buf.len);
                err_code = nrf_queue_push(&m_buf_queue, &buf);
                APP_ERROR_CHECK(err_code);
        } else
        {
                APP_ERROR_CHECK(err_code);
        }

        // for (uint32_t i = 0; i < data_len; i++)
        // {
        //         do
        //         {
        //                 ret_val = app_uart_put(p_data[i]);
        //                 if ((ret_val != NRF_SUCCESS) && (ret_val != NRF_ERROR_BUSY))
        //                 {
        //                         NRF_LOG_ERROR("app_uart_put failed for index 0x%04x.", i);
        //                         APP_ERROR_CHECK(ret_val);
        //                 }
        //         } while (ret_val == NRF_ERROR_BUSY);
        // }
        // if (p_data[data_len-1] == '\r')
        // {
        //         while (app_uart_put('\n') == NRF_ERROR_BUSY);
        // }
}


// /**@brief   Function for handling app_uart events.
//  *
//  * @details This function receives a single character from the app_uart module and appends it to
//  *          a string. The string is sent over BLE when the last character received is a
//  *          'new line' '\n' (hex 0x0A) or if the string reaches the maximum data length.
//  */
// void uart_event_handle(app_uart_evt_t * p_event)
// {
//         static uint8_t data_array[BLE_NUS_MAX_DATA_LEN];
//         static uint16_t index = 0;
//         uint32_t ret_val;
//
//         switch (p_event->evt_type)
//         {
//         /**@snippet [Handling data from UART] */
//         case APP_UART_DATA_READY:
//                 UNUSED_VARIABLE(app_uart_get(&data_array[index]));
//                 index++;
//
//                 if ((data_array[index - 1] == '\n') ||
//                     (data_array[index - 1] == '\r') ||
//                     (index >= (m_ble_nus_max_data_len)))
//                 {
//                         NRF_LOG_DEBUG("Ready to send data over BLE NUS");
//                         NRF_LOG_HEXDUMP_DEBUG(data_array, index);
//
//                         do
//                         {
//                                 ret_val = ble_nus_c_string_send(&m_ble_nus_c, data_array, index);
//                                 if ( (ret_val != NRF_ERROR_INVALID_STATE) && (ret_val != NRF_ERROR_RESOURCES) )
//                                 {
//                                         APP_ERROR_CHECK(ret_val);
//                                 }
//                         } while (ret_val == NRF_ERROR_RESOURCES);
//
//                         index = 0;
//                 }
//                 break;
//
//         /**@snippet [Handling data from UART] */
//         case APP_UART_COMMUNICATION_ERROR:
//                 NRF_LOG_ERROR("Communication error occurred while handling UART.");
//                 APP_ERROR_HANDLER(p_event->data.error_communication);
//                 break;
//
//         case APP_UART_FIFO_ERROR:
//                 NRF_LOG_ERROR("Error occurred in FIFO module used by UART.");
//                 APP_ERROR_HANDLER(p_event->data.error_code);
//                 break;
//
//         default:
//                 break;
//         }
// }


/**@brief Callback handling Nordic UART Service (NUS) client events.
 *
 * @details This function is called to notify the application of NUS client events.
 *
 * @param[in]   p_ble_nus_c   NUS client handle. This identifies the NUS client.
 * @param[in]   p_ble_nus_evt Pointer to the NUS client event.
 */

/**@snippet [Handling events from the ble_nus_c module] */
static void ble_nus_c_evt_handler(ble_nus_c_t * p_ble_nus_c, ble_nus_c_evt_t const * p_ble_nus_evt)
{
        ret_code_t err_code;

        switch (p_ble_nus_evt->evt_type)
        {
        case BLE_NUS_C_EVT_DISCOVERY_COMPLETE:
                NRF_LOG_INFO("Discovery complete.");
                err_code = ble_nus_c_handles_assign(p_ble_nus_c, p_ble_nus_evt->conn_handle, &p_ble_nus_evt->handles);
                APP_ERROR_CHECK(err_code);

                err_code = ble_nus_c_tx_notif_enable(p_ble_nus_c);
                APP_ERROR_CHECK(err_code);
                NRF_LOG_INFO("Connected to device with Nordic UART Service.");
                break;

