jimmywong2003/nrf5281x_s113_uart_example/ble_app_uart_c_libuarte/main.c
/**@brief Function for initializing the GATT library. */
void gatt_init(void)
{
        ret_code_t err_code;

        err_code = nrf_ble_gatt_init(&m_gatt, gatt_evt_handler);
        APP_ERROR_CHECK(err_code);

        err_code = nrf_ble_gatt_att_mtu_central_set(&m_gatt, NRF_SDH_BLE_GATT_MAX_MTU_SIZE);
        APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling events from the BSP module.
 *
 * @param[in] event  Event generated by button press.
 */
void bsp_event_handler(bsp_event_t event)
{
        ret_code_t err_code;

        switch (event)
        {
        case BSP_EVENT_SLEEP:
                nrf_pwr_mgmt_shutdown(NRF_PWR_MGMT_SHUTDOWN_GOTO_SYSOFF);
                break;

        case BSP_EVENT_DISCONNECT:
                err_code = sd_ble_gap_disconnect(m_ble_nus_c.conn_handle,
                                                 BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
                if (err_code != NRF_ERROR_INVALID_STATE)
                {
                        APP_ERROR_CHECK(err_code);
                }
                break;

        default:
                break;
        }
}

// /**@brief Function for initializing the UART. */
// static void uart_init(void)
// {
//         ret_code_t err_code;
//
//         app_uart_comm_params_t const comm_params =
//         {
//                 .rx_pin_no    = RX_PIN_NUMBER,
//                 .tx_pin_no    = TX_PIN_NUMBER,
//                 .rts_pin_no   = RTS_PIN_NUMBER,
//                 .cts_pin_no   = CTS_PIN_NUMBER,
//                 .flow_control = APP_UART_FLOW_CONTROL_DISABLED,
//                 .use_parity   = false,
//                 .baud_rate    = UART_BAUDRATE_BAUDRATE_Baud115200
//         };
//
//         APP_UART_FIFO_INIT(&comm_params,
//                            UART_RX_BUF_SIZE,
//                            UART_TX_BUF_SIZE,
//                            uart_event_handle,
//                            APP_IRQ_PRIORITY_LOWEST,
//                            err_code);
//
//         APP_ERROR_CHECK(err_code);
// }

/**@brief Function for initializing the Nordic UART Service (NUS) client. */
static void nus_c_init(void)
{
        ret_code_t err_code;
        ble_nus_c_init_t init;

        init.evt_handler   = ble_nus_c_evt_handler;
        init.error_handler = nus_error_handler;
        init.p_gatt_queue  = &m_ble_gatt_queue;

        err_code = ble_nus_c_init(&m_ble_nus_c, &init);
        APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing buttons and leds. */
static void buttons_leds_init(void)
{
        ret_code_t err_code;
        bsp_event_t startup_event;

        err_code = bsp_init(BSP_INIT_LEDS, bsp_event_handler);
        APP_ERROR_CHECK(err_code);

        err_code = bsp_btn_ble_init(NULL, &startup_event);
        APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing the timer. */
static void timer_init(void)
{
        ret_code_t err_code = app_timer_init();
        APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing the nrf log module. */
static void log_init(void)
{
        ret_code_t err_code = NRF_LOG_INIT(NULL);
        APP_ERROR_CHECK(err_code);

        NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/**@brief Function for initializing power management.
 */
static void power_management_init(void)
{
        ret_code_t err_code;
        err_code = nrf_pwr_mgmt_init();
        APP_ERROR_CHECK(err_code);
}


/** @brief Function for initializing the database discovery module. */
static void db_discovery_init(void)
{
        ble_db_discovery_init_t db_init;

        memset(&db_init, 0, sizeof(ble_db_discovery_init_t));

        db_init.evt_handler  = db_disc_handler;
        db_init.p_gatt_queue = &m_ble_gatt_queue;

        ret_code_t err_code = ble_db_discovery_init(&db_init);
        APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the idle state (main loop).
 *
 * @details Handles any pending log operations, then sleeps until the next event occurs.
 */
static void idle_state_handle(void)
{
        if (NRF_LOG_PROCESS() == false)
        {
                nrf_pwr_mgmt_run();
        }
}


int main(void)
{
        // Initialize.
        log_init();
        timer_init();
        // uart_init();

        libuart_init();
        buttons_leds_init();
        db_discovery_init();
        power_management_init();
        ble_stack_init();
        scheduler_init();
        gatt_init();
        nus_c_init();
        scan_init();

        // Start execution.
        //printf("BLE UART central example started.\r\n");
        NRF_LOG_INFO("BLE UART central example started.");
        scan_start();

        // Enter main loop.
        for (;;)
        {
                idle_state_handle();
        }
}
